```cpp
#include <iostream>
#include <assert.h>

class Father {
public:

    Father() {
        m_father = new int(1);
    }

    Father(int i) {
        m_father = new int(i);
    }

    ~Father() {
        delete m_father;
        std::cout << "Father destructor" << std::endl;
    }

    Father(const Father& father) {
        m_father = new int(*father.m_father);
        std::cout << "Father copy constructor" << std::endl;
    }

    Father(Father&& father) noexcept{
        m_father = father.m_father;
        father.m_father = nullptr;
        std::cout << "Father move constructor" << std::endl;
    }

    Father& operator=(Father father) {
        using std::swap;
        swap(m_father, father.m_father);
        return *this;
    }

    void f() {
        std::cout << "Father f()" << std::endl;

    }

    virtual void test_func() {
		std::cout << "Father test_func()" << std::endl;
	}

    int* m_father{ nullptr };
    //std::string father_name{"father"};
};

class Mother {
public:
    Mother() {
        m_mother = new int(2);
    }

    Mother(int i) {
        m_mother = new int(i);
    }

    ~Mother() {
        delete m_mother;
        std::cout << "Mother destructor" << std::endl;
    }

    Mother(const Mother& mother) {
        m_mother = new int(*mother.m_mother);
        std::cout << "Mother copy constructor" << std::endl;
    }

    Mother(Mother&& mother) noexcept{
        m_mother = mother.m_mother;
        mother.m_mother = nullptr;
        std::cout << "Mother move constructor" << std::endl;
    }

    Mother& operator=(Mother mother) {
        using std::swap;
        swap(m_mother, mother.m_mother);
        return *this;
    }

    void f(const std::string& str) {
        std::cout << "Mother f(): " << str << std::endl;
    }

    virtual void another_test_func() {
        std::cout << "Mother another_test_func()" << std::endl;
    }
    int* m_mother{ nullptr };
};

class Son : public Father, public Mother {
public:
    Son() {
        std::cout << "Son constructor" << std::endl;
    }

    Son(int i, int j) : Father(i), Mother(j) {
        std::cout << "Son constructor i, j" << std::endl;
    }

    ~Son() {
        std::cout << "Son destructor" << std::endl;
    }

    Son(const Son& son) : Father(son), Mother(son) {
        std::cout << "Son copy constructor" << std::endl;
    }

    Son(Son&& son) noexcept : Father(std::move(son)), Mother(std::move(son)) {
        std::cout << "Son move constructor" << std::endl;
    }

    friend void swap(Son& first, Son& second) {
        using std::swap;
        swap(first.m_father, second.m_father);
        swap(first.m_mother, second.m_mother);
    }

    Son& operator=(Son son) {
        using std::swap;
        swap(*this, son);
        return *this;
    }

    void test_func() override {
        std::cout << "Son test_func()" << std::endl;
    }

    void another_test_func() override {
		std::cout << "Son another_test_func()" << std::endl;
	}

    virtual void son_test_func() {
		std::cout << "Son son_test_func()" << std::endl;
    }
private:
    std::string m_name{"son" };
};

class StepSon : public Father {
    virtual void test_func() override {
		std::cout << "StepSon test_func()" << std::endl;
	}

    virtual void step_test_func() {}
    int m_age{ 0 };
};

class GrandSon : public Son {
	virtual void test_func() override {
		std::cout << "GrandSon test_func()" << std::endl;
	}
	int m_age{ 0 };
};;

int main(int argc, const char** argv) {}
```
#### 类的布局
![[Son_Constructor.png]]

![[GrandSon_Constructor.png]]
#### 虚表的布局

从虚表的布局看：子类没有自己的虚表指针， 即使是GrandSon类也没有, 应该都是通过Father 或者 Mother 的虚表指针和虚表中的 meta 信息定位。
```txt
C:\Program Files\Microsoft Visual Studio\2022\Community>cl /d1 reportSingleClassLayoutSon D:\workspace\cpp\TearClass\tearClass.cpp
Microsoft (R) C/C++ Optimizing Compiler Version 19.39.33523 for x64
Copyright (C) Microsoft Corporation.  All rights reserved.

tearClass.cpp
D:\workspace\cpp\TearClass\tearClass.cpp(1): warning C4819: The file contains a character that cannot be represented in the current code page (936). Save the file in Unicode format to prevent data loss

class Son       size(64):
        +---
 0      | +--- (base class Father)
 0      | | {vfptr}
 8      | | m_father
        | +---
16      | +--- (base class Mother)
16      | | {vfptr}
24      | | m_mother
        | +---
32      | ?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@ m_name
        +---

Son::$vftable@Father@:
        | &Son_meta
        |  0
 0      | &Son::test_func
 1      | &Son::son_test_func

Son::$vftable@Mother@:
        | -16
 0      | &Son::another_test_func

Son::test_func this adjustor: 0
Son::another_test_func this adjustor: 16
Son::son_test_func this adjustor: 0

class StepSon   size(24):
        +---
 0      | +--- (base class Father)
 0      | | {vfptr}
 8      | | m_father
        | +---
16      | m_age
        | <alignment member> (size=4)
        +---

StepSon::$vftable@:
        | &StepSon_meta
        |  0
 0      | &StepSon::test_func
 1      | &StepSon::step_test_func

StepSon::test_func this adjustor: 0
StepSon::step_test_func this adjustor: 0

class GrandSon  size(72):
        +---
 0      | +--- (base class Son)
 0      | | +--- (base class Father)
 0      | | | {vfptr}
 8      | | | m_father
        | | +---
16      | | +--- (base class Mother)
16      | | | {vfptr}
24      | | | m_mother
        | | +---
32      | | ?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@ m_name
        | +---
64      | m_age
        | <alignment member> (size=4)
        +---

GrandSon::$vftable@Father@:
        | &GrandSon_meta
        |  0
 0      | &GrandSon::test_func
 1      | &Son::son_test_func

GrandSon::$vftable@Mother@:
        | -16
 0      | &Son::another_test_func

GrandSon::test_func this adjustor: 0
/out:tearClass.exe
tearClass.obj
```

linux下查看是用
```bash
g++ -fdump-lang-class xxx.cpp
```