[
  "table-editor-obsidian",
  "obsidian-kanban",
  "code-block-copy",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-mind-map",
  "dataview",
  "quick-explorer",
  "obsidian-git",
  "obsidian-minimal-settings",
  "obsidian-auto-link-title"
]